Revit 2027 API
TransactionAttribute.Mode Property
Transaction mode.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TransactionMode Mode { get; }
Public ReadOnly Property Mode As TransactionMode
	Get
public:
property TransactionMode Mode {
	TransactionMode get ();
}
member Mode : TransactionMode with get
Property Value
TransactionMode
See Also
Reference
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace